БИТУправление_медицинским_центром_демо/src/Catalogs/НастройкиПоискаКлиентов/НастройкиПоискаКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиПоискаКлиентов</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпоновщикНастроекОсновнойСхемы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаРасположенияОтборов</name>
    <type>
      <types>EnumRef.ВидыНастроекРасположенияОтборовФормыПодбораКлиентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиОтдельныхСхемКомпоновки</name>
    <attributes>
      <name>ИмяСхемы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НастройкиКомпоновки</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/НастройкиПоискаКлиентов/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Записывает настройки поиска по параметрам из формы.
//
// Параметры:
//  ИмяНастройки			 - Строка	- настройка.
//  СхемыКомпоновкиДанных	 - Массив	- настройки компоновки с отборами.
//  НастройкиОсновнойСхемы	 - КомпоновщикНастроекКомпоновкиДанных	- настройки компоновки с отборами из основной схемы.
//  НастройкаРасположения	 - ПеречислениеСсылка.ВидыНастроекРасположенияОтборовФормыПодбораКлиентов	 - расположение.
// 
// Возвращаемое значение:
//  СправочникСсылка.НастройкиПоискаКлиентов - .
//
Функция ЗаписатьНастройкиПоиска(ИмяНастройки, СхемыКомпоновкиДанных, НастройкиОсновнойСхемы, НастройкаРасположения) Экспорт
	
	Если ТипЗнч(ИмяНастройки) = Тип("СправочникСсылка.НастройкиПоискаКлиентов") Тогда
		НастройкаОбъект = ИмяНастройки.ПолучитьОбъект();
	Иначе
		НастройкаОбъект = Справочники.НастройкиПоискаКлиентов.СоздатьЭлемент();
		НастройкаОбъект.Наименование = ИмяНастройки; 
	КонецЕсли;
	
	НастройкаОбъект.НастройкаРасположенияОтборов = НастройкаРасположения;
	НастройкаОбъект.КомпоновщикНастроекОсновнойСхемы = Новый ХранилищеЗначения(НастройкиОсновнойСхемы);
	
	ТаблицаНастроек = НастройкаОбъект.НастройкиОтдельныхСхемКомпоновки;
	ТаблицаНастроек.Очистить();
	
	Для Каждого СтрокаСхемы Из СхемыКомпоновкиДанных Цикл
		НоваяСтрока = ТаблицаНастроек.Добавить();
		НоваяСтрока.ИмяСхемы = СтрокаСхемы.ИмяСхемы;
		НоваяСтрока.НастройкиКомпоновки = 
			Новый ХранилищеЗначения(СтрокаСхемы.НастройкиКомпоновки);
	КонецЦикла;
		
	НастройкаОбъект.Записать();
	
	Возврат НастройкаОбъект.Ссылка;
	
КонецФункции
#КонецОбласти
